#### Terraform Plan 📖`success`
#### `Plan: 49 to add, 4 to change, 26 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf-repo-manager/runs/run-YdRr73G8WwPf7iJ4

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_repository.this: Refreshing state... [id=tf-repo-manager]
module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=timezone_iii]
module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=autopatch_ii]
module.chef_cb_repos.module.looper["chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_software]
module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=collectd_ii]
module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=artifactory_ii]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch.this: Refreshing state... [id=tf-repo-manager:main]
tfe_oauth_client.github: Refreshing state... [id=oc-YUbxCjZ5CgiEXsew]
module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=timezone_iii:limitusus]
module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch.this: Refreshing state... [id=autopatch_ii:main]
module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch.this: Refreshing state... [id=timezone_iii:main]
module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch.this: Refreshing state... [id=artifactory_ii:main]
module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch.this: Refreshing state... [id=collectd_ii:main]
module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch.this: Refreshing state... [id=chef_software:main]
module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf-repo-manager]
module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch.this: Refreshing state... [id=aws_temp_saml_creds:main]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch.this: Refreshing state... [id=chef-repo:main]
module.other_repos.module.looper["kickstart"].module.repository.github_branch.this: Refreshing state... [id=kickstart:main]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk:main]
module.tf_repos.module.looper["tf-repo-manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]
module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]
module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=artifactory_ii]
module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=autopatch_ii]
module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_software]
module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=collectd_ii]
module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=timezone_iii]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch.this will be destroyed
  # (because module.chef_cb_repos.module.looper["artifactory_ii"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"435910b4add8dbfa2b483243bdf176ea8c28e66976e08e469dd3756f6d2423a3\"" -> null
      - id            = "artifactory_ii:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "artifactory_ii" -> null
      - sha           = "03a284e0a0bb2c82d76ae2ea134ce391e64578cf" -> null
      - source_branch = "main" -> null
    }

  # module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch_default.this will be destroyed
  # (because module.chef_cb_repos.module.looper["artifactory_ii"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "artifactory_ii" -> null
      - repository = "artifactory_ii" -> null
    }

  # module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_branch_protection.default will be destroyed
  # (because module.chef_cb_repos.module.looper["artifactory_ii"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODc5MjM1NQ==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "Changelog Validator",
              - "Metadata Version Validator",
              - "Release Label Validator",
              - "cookstyle",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["artifactory_ii"].module.repository.github_repository.this will be destroyed
  # (because module.chef_cb_repos.module.looper["artifactory_ii"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = true
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Development repository for the artifactory_ii Chef Cookbook" -> null
      - etag                   = "W/\"35bbdf47a08a4f1c8ace387353f1db3c0b6ae3a33bb19fc4fc7cb5a1e73b5fa2\"" -> null
      - full_name              = "Stromweld/artifactory_ii" -> null
      - git_clone_url          = "git://github.com/Stromweld/artifactory_ii.git" -> null
      - gitignore_template     = "ChefCookbook" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/artifactory_ii" -> null
      - http_clone_url         = "https://github.com/Stromweld/artifactory_ii.git" -> null
      - id                     = "artifactory_ii" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "artifactory_ii" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnk4ODc5MjM1NQ==" -> null
      - private                = false -> null
      - repo_id                = 88792355 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/artifactory_ii.git" -> null
      - svn_url                = "https://github.com/Stromweld/artifactory_ii" -> null
      - topics                 = [
          - "chef",
          - "chef-cookbook",
          - "chef-resource",
          - "managed-by-terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch.this will be destroyed
  # (because module.chef_cb_repos.module.looper["autopatch_ii"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"498934179a33405b144c8911f9fe58622825b91fcf26ad1f72bc5e5455f8038b\"" -> null
      - id            = "autopatch_ii:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "autopatch_ii" -> null
      - sha           = "a927c2da1faffb6e7083cffb46927927b5585358" -> null
      - source_branch = "main" -> null
    }

  # module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch_default.this will be destroyed
  # (because module.chef_cb_repos.module.looper["autopatch_ii"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "autopatch_ii" -> null
      - repository = "autopatch_ii" -> null
    }

  # module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_branch_protection.default will be destroyed
  # (because module.chef_cb_repos.module.looper["autopatch_ii"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODc5MjI4Mw==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "Changelog Validator",
              - "Metadata Version Validator",
              - "Release Label Validator",
              - "cookstyle",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["autopatch_ii"].module.repository.github_repository.this will be destroyed
  # (because module.chef_cb_repos.module.looper["autopatch_ii"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = true
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Development repository for the autopatch_ii Chef Cookbook" -> null
      - etag                   = "W/\"de1c80f2f80cb83f55ec6bc07190e7303b37d849b83506958423bcd4408043fe\"" -> null
      - full_name              = "Stromweld/autopatch_ii" -> null
      - git_clone_url          = "git://github.com/Stromweld/autopatch_ii.git" -> null
      - gitignore_template     = "ChefCookbook" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/autopatch_ii" -> null
      - http_clone_url         = "https://github.com/Stromweld/autopatch_ii.git" -> null
      - id                     = "autopatch_ii" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "autopatch_ii" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnk4ODc5MjI4Mw==" -> null
      - private                = false -> null
      - repo_id                = 88792283 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/autopatch_ii.git" -> null
      - svn_url                = "https://github.com/Stromweld/autopatch_ii" -> null
      - topics                 = [
          - "chef",
          - "chef-cookbook",
          - "chef-resource",
          - "managed-by-terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_artifactory_ii"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_artifactory_ii"
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_artifactory_ii Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_artifactory_ii"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_autopatch_ii"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_autopatch_ii"
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_autopatch_ii Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_autopatch_ii"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_base"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_base"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_base"
    }

  # module.chef_cb_repos.module.looper["chef_base"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_base"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_base Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_base"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_chef_software"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_chef_software"
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_chef_software Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_chef_software"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_collectd_ii"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_collectd_ii"
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_collectd_ii Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_collectd_ii"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch.this will be destroyed
  # (because module.chef_cb_repos.module.looper["chef_software"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"cd2edfe667adda82c729ad6f2e5f9869d0375af72617a83a6abb94e58f362ed4\"" -> null
      - id            = "chef_software:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "chef_software" -> null
      - sha           = "4bce8bec00fb284c6bcfe584327696f79a51e2b4" -> null
      - source_branch = "main" -> null
    }

  # module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch_default.this will be destroyed
  # (because module.chef_cb_repos.module.looper["chef_software"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "chef_software" -> null
      - repository = "chef_software" -> null
    }

  # module.chef_cb_repos.module.looper["chef_software"].module.repository.github_branch_protection.default will be destroyed
  # (because module.chef_cb_repos.module.looper["chef_software"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOCbOQcM4Bh7gD" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnkxNjI3NjI4NjQ=" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "Changelog Validator",
              - "Metadata Version Validator",
              - "Release Label Validator",
              - "cookstyle",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["chef_software"].module.repository.github_repository.this will be destroyed
  # (because module.chef_cb_repos.module.looper["chef_software"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = false
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Development repository for the chef_software Chef Cookbook" -> null
      - etag                   = "W/\"e0db73118f618138fc4de5aed7a4e6c6bd8f3735e11618ec223e81921a8c0b9c\"" -> null
      - full_name              = "Stromweld/chef_software" -> null
      - git_clone_url          = "git://github.com/Stromweld/chef_software.git" -> null
      - gitignore_template     = "ChefCookbook" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/chef_software" -> null
      - http_clone_url         = "https://github.com/Stromweld/chef_software.git" -> null
      - id                     = "chef_software" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "chef_software" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkxNjI3NjI4NjQ=" -> null
      - private                = false -> null
      - repo_id                = 162762864 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/chef_software.git" -> null
      - svn_url                = "https://github.com/Stromweld/chef_software" -> null
      - topics                 = [
          - "chef",
          - "chef-cookbook",
          - "chef-resource",
          - "managed-by-terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "chef_timezone_iii"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "chef_timezone_iii"
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = true
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the chef_timezone_iii Chef Cookbook"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "ChefCookbook"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "chef_timezone_iii"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "chef_timezone_iii"
      + username                    = "limitusus"
    }

  # module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch.this will be destroyed
  # (because module.chef_cb_repos.module.looper["collectd_ii"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"048734d810dfbec89d5c3ae9ae75958a77e7f0564288411ee8de01b888ee2d5f\"" -> null
      - id            = "collectd_ii:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "collectd_ii" -> null
      - sha           = "6b8f152ef83121ccaf5be5c7f0eeddd7c3cd5a41" -> null
      - source_branch = "main" -> null
    }

  # module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch_default.this will be destroyed
  # (because module.chef_cb_repos.module.looper["collectd_ii"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "collectd_ii" -> null
      - repository = "collectd_ii" -> null
    }

  # module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_branch_protection.default will be destroyed
  # (because module.chef_cb_repos.module.looper["collectd_ii"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODc5MjE3OQ==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "Changelog Validator",
              - "Metadata Version Validator",
              - "Release Label Validator",
              - "cookstyle",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["collectd_ii"].module.repository.github_repository.this will be destroyed
  # (because module.chef_cb_repos.module.looper["collectd_ii"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = true
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Development repository for the collectd_ii Chef Cookbook" -> null
      - etag                   = "W/\"606653143067423998a84b1c062aed084366b86d4fa24bcf57d6b2e7658b6201\"" -> null
      - full_name              = "Stromweld/collectd_ii" -> null
      - git_clone_url          = "git://github.com/Stromweld/collectd_ii.git" -> null
      - gitignore_template     = "ChefCookbook" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/collectd_ii" -> null
      - http_clone_url         = "https://github.com/Stromweld/collectd_ii.git" -> null
      - id                     = "collectd_ii" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "collectd_ii" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnk4ODc5MjE3OQ==" -> null
      - private                = false -> null
      - repo_id                = 88792179 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/collectd_ii.git" -> null
      - svn_url                = "https://github.com/Stromweld/collectd_ii" -> null
      - topics                 = [
          - "chef",
          - "chef-cookbook",
          - "chef-resource",
          - "managed-by-terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch.this will be destroyed
  # (because module.chef_cb_repos.module.looper["timezone_iii"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"8e555fba86dad67abf24d423a4d743fa851da86941a90347d8bcbae525a43a1a\"" -> null
      - id            = "timezone_iii:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "timezone_iii" -> null
      - sha           = "b63c4b63f603919f067dd19f2a3dfcbe9577a18d" -> null
      - source_branch = "main" -> null
    }

  # module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch_default.this will be destroyed
  # (because module.chef_cb_repos.module.looper["timezone_iii"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "timezone_iii" -> null
      - repository = "timezone_iii" -> null
    }

  # module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_branch_protection.default will be destroyed
  # (because module.chef_cb_repos.module.looper["timezone_iii"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODY2Mjc4NA==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "Changelog Validator",
              - "Metadata Version Validator",
              - "Release Label Validator",
              - "cookstyle",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_repository.this will be destroyed
  # (because module.chef_cb_repos.module.looper["timezone_iii"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "master"
              - protected = true
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Development repository for the timezone_iii Chef Cookbook" -> null
      - etag                   = "W/\"c3521d20419e35e00fc440057bb8e050c26ceeb60f38a4b071dac6fa7e547cee\"" -> null
      - full_name              = "Stromweld/timezone_iii" -> null
      - git_clone_url          = "git://github.com/Stromweld/timezone_iii.git" -> null
      - gitignore_template     = "ChefCookbook" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/timezone_iii" -> null
      - http_clone_url         = "https://github.com/Stromweld/timezone_iii.git" -> null
      - id                     = "timezone_iii" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "timezone_iii" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnk4ODY2Mjc4NA==" -> null
      - private                = false -> null
      - repo_id                = 88662784 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/timezone_iii.git" -> null
      - svn_url                = "https://github.com/Stromweld/timezone_iii" -> null
      - topics                 = [
          - "chef",
          - "chef-cookbook",
          - "chef-resource",
          - "managed-by-terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.chef_cb_repos.module.looper["timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"] will be destroyed
  # (because module.chef_cb_repos.module.looper["timezone_iii"].module.repository is not in configuration)
  - resource "github_repository_collaborator" "this" {
      - id                          = "timezone_iii:limitusus" -> null
      - permission                  = "push" -> null
      - permission_diff_suppression = false -> null
      - repository                  = "timezone_iii" -> null
      - username                    = "limitusus" -> null
    }

  # module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOBP18Nc4Bh7f_"
        # (9 unchanged attributes hidden)


      ~ required_status_checks {
          ~ contexts = [
              - "*",
              + "check",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ]
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOFQgqW84Bh7gA"
        # (9 unchanged attributes hidden)


      ~ required_status_checks {
          ~ contexts = [
              - "*",
              + "check",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ]
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOCbdKjM4Bh7f-"
        # (9 unchanged attributes hidden)


      ~ required_status_checks {
          ~ contexts = [
              - "*",
              + "check",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ]
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-workflows"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "github-workflows"
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Collection of Github workflows"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "github-workflows"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "managed-by-terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOCW9ReM4Bh7gC"
        # (9 unchanged attributes hidden)


      ~ required_status_checks {
          ~ contexts = [
              - "*",
              + "check",
              - "json-lint",
              - "markdown-lint",
              - "yaml-lint",
            ]
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "terraform-github-repositories"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "terraform-github-repositories"
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the terraform-github-repositories Terraform Module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "terraform-github-repositories"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "managed-by-terraform",
          + "terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module will be created
  + resource "tfe_registry_module" "tf_module" {
      + id              = (known after apply)
      + module_provider = (known after apply)
      + name            = (known after apply)
      + organization    = (known after apply)

      + vcs_repo {
          + display_identifier = (known after apply)
          + identifier         = (known after apply)
          + oauth_token_id     = "ot-T16bx38uvu2u9r1K"
        }
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "terraform-tfe-private-modules"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "terraform-tfe-private-modules"
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the terraform-tfe-private-modules Terraform Module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "terraform-tfe-private-modules"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "managed-by-terraform",
          + "terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module will be created
  + resource "tfe_registry_module" "tf_module" {
      + id              = (known after apply)
      + module_provider = (known after apply)
      + name            = (known after apply)
      + organization    = (known after apply)

      + vcs_repo {
          + display_identifier = (known after apply)
          + identifier         = (known after apply)
          + oauth_token_id     = "ot-T16bx38uvu2u9r1K"
        }
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "terraform-tfe-workspaces"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "terraform-tfe-workspaces"
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Development repository for the terraform-tfe-workspaces Terraform Module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "terraform-tfe-workspaces"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "managed-by-terraform",
          + "terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module will be created
  + resource "tfe_registry_module" "tf_module" {
      + id              = (known after apply)
      + module_provider = (known after apply)
      + name            = (known after apply)
      + organization    = (known after apply)

      + vcs_repo {
          + display_identifier = (known after apply)
          + identifier         = (known after apply)
          + oauth_token_id     = "ot-T16bx38uvu2u9r1K"
        }
    }

  # module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch.this will be destroyed
  # (because module.tf_repos.module.looper["tf-repo-manager"].module.repository is not in configuration)
  - resource "github_branch" "this" {
      - branch        = "main" -> null
      - etag          = "W/\"7cb84846cdd50305bdf56d48444d877ad22c6b7cfff9805051dfc2f6b939207e\"" -> null
      - id            = "tf-repo-manager:main" -> null
      - ref           = "refs/heads/main" -> null
      - repository    = "tf-repo-manager" -> null
      - sha           = "4cbcbb1200e8027dbd1bca70063ca171aa62f397" -> null
      - source_branch = "main" -> null
    }

  # module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch_default.this will be destroyed
  # (because module.tf_repos.module.looper["tf-repo-manager"].module.repository is not in configuration)
  - resource "github_branch_default" "this" {
      - branch     = "main" -> null
      - id         = "tf-repo-manager" -> null
      - repository = "tf-repo-manager" -> null
    }

  # module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_branch_protection.default will be destroyed
  # (because module.tf_repos.module.looper["tf-repo-manager"].module.repository is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - id                              = "BPR_kwDOHSeHTM4Bh7gF" -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "R_kgDOHSeHTA" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "*",
              - "json-lint",
              - "markdown-lint",
              - "terraform-fmt",
              - "terraform-lint",
              - "terraform-plan",
              - "terraform-validate",
              - "yaml-lint",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.tf_repos.module.looper["tf-repo-manager"].module.repository.github_repository.this will be destroyed
  # (because module.tf_repos.module.looper["tf-repo-manager"].module.repository is not in configuration)
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = true
            },
        ] -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Terraform Github Repository Manager" -> null
      - etag                   = "W/\"f2c78dc66c94cf6df2eb765f174db56a42ad35c8204e1e68a92380481216f91d\"" -> null
      - full_name              = "Stromweld/tf-repo-manager" -> null
      - git_clone_url          = "git://github.com/Stromweld/tf-repo-manager.git" -> null
      - gitignore_template     = "Terraform" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/Stromweld/tf-repo-manager" -> null
      - http_clone_url         = "https://github.com/Stromweld/tf-repo-manager.git" -> null
      - id                     = "tf-repo-manager" -> null
      - is_template            = false -> null
      - license_template       = "apache-2.0" -> null
      - name                   = "tf-repo-manager" -> null
      - node_id                = "R_kgDOHSeHTA" -> null
      - private                = false -> null
      - repo_id                = 489129804 -> null
      - ssh_clone_url          = "git@github.com:Stromweld/tf-repo-manager.git" -> null
      - svn_url                = "https://github.com/Stromweld/tf-repo-manager" -> null
      - topics                 = [
          - "managed-by-terraform",
          - "terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.tf_repos.module.looper["tf-repo-manager"].module.tf_workspace["default"].tfe_workspace.workspace will be destroyed
  # (because module.tf_repos.module.looper["tf-repo-manager"].module.tf_workspace["default"] is not in configuration)
  - resource "tfe_workspace" "workspace" {
      - allow_destroy_plan            = true -> null
      - auto_apply                    = false -> null
      - description                   = "Terraform Github Repository Manager" -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - global_remote_state           = false -> null
      - id                            = "ws-sKUnXifAZaTLrKVo" -> null
      - name                          = "tf-repo-manager" -> null
      - operations                    = true -> null
      - organization                  = "Stromweld" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [] -> null
      - terraform_version             = "1.1.9" -> null
      - trigger_prefixes              = [] -> null
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tf_repo_manager"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "tf_repo_manager"
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Terraform Github Repository Manager"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "apache-2.0"
      + name                   = "tf_repo_manager"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "managed-by-terraform",
          + "terraform",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace will be created
  + resource "tfe_workspace" "workspace" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Terraform Github Repository Manager"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "tf_repo_manager"
      + operations                    = (known after apply)
      + organization                  = "Stromweld"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = (known after apply)
      + terraform_version             = "1.1.9"
      + trigger_prefixes              = (known after apply)
    }

Plan: 49 to add, 4 to change, 26 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*